[Killed] BlockStatement
src/domain/service/Actors.ts:4:32
 import { Actors as ActorsModel } from '../../model/Actors';
 
 export class Actors {
-  public static async getAll() {
-    return ActorsModel.getAll();
-  }
+  public static async getAll() {}
 
   public static async getById(id: number) {
killedBy: The Actors controller Get all actors should return all users
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"first_name": "PETER", "id": 1, "last_name": "BERKMAN"}, {"first_name": "JAMES", "id": 2, "last_name": "DEVITO"}, {"first_name": "LUKES", "id": 3, "last_name": "SILAS"}]
Received: undefined

[Killed] BlockStatement
src/domain/service/Actors.ts:8:43
     return ActorsModel.getAll();
   }
 
-  public static async getById(id: number) {
-    const response = await ActorsModel.getById(id);
-
-    if (response === null) {
-      return null;
-    }
-
-    if (response.length === 0) {
-      return { actor: {} };
-    }
-
-    return { actor: response[0] };
-  }
+  public static async getById(id: number) {}
 }
 
killedBy: The Actors controller getById should call the actors service using the id
statusReason: TypeError: Cannot read properties of undefined (reading 'actor')

[Killed] ConditionalExpression
src/domain/service/Actors.ts:11:9
   public static async getById(id: number) {
     const response = await ActorsModel.getById(id);
 
-    if (response === null) {
+    if (false) {
       return null;
     }
killedBy: The Actors controller Get actor by id should return null if DB returns null
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] EqualityOperator
src/domain/service/Actors.ts:11:9
   public static async getById(id: number) {
     const response = await ActorsModel.getById(id);
 
-    if (response === null) {
+    if (response !== null) {
       return null;
     }
killedBy: The Actors controller Get actor by id should return an empty object if no actors are found
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"actor": {}}
Received: null

[Killed] BlockStatement
src/domain/service/Actors.ts:15:32
       return null;
     }
 
-    if (response.length === 0) {
-      return { actor: {} };
-    }
+    if (response.length === 0) {}
 
     return { actor: response[0] };
killedBy: The Actors controller Get actor by id should return an empty object if no actors are found
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "actor": Object {},
+   "actor": undefined,

[Killed] EqualityOperator
src/domain/service/Actors.ts:15:9
       return null;
     }
 
-    if (response.length === 0) {
+    if (response.length !== 0) {
       return { actor: {} };
     }
killedBy: The Actors controller Get actor by id should return an empty object if no actors are found
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "actor": Object {},
+   "actor": undefined,

[Killed] ObjectLiteral
src/domain/service/Actors.ts:19:12
       return { actor: {} };
     }
 
-    return { actor: response[0] };
+    return {};
   }
 }
killedBy: The Actors controller Get actor by id should return one actor object if any actors are found
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "actor": Object {
-     "first_name": "PETER",
