[Killed] BlockStatement
src/infrastructure/controller/Actors.ts:6:60
 import { httpCodes } from '../httpCodes';
 
 export class Actors {
-  public static async getById(req: Request, res: Response) {
-    const id = Number(req.params.id);
-    const actor = await ActorsService.getById(id);
-
-    if (actor === null) {
-      res.status(httpCodes.internalServerError).json({ message: 'Our bad. Internal server error' });
-      return;
-    }
-
-    const responseKeys = Object.keys(actor.actor);
-    if (responseKeys.length === 3) {
-      res.status(httpCodes.success).json({ payload: actor });
-      return;
-    }
-
-    res.status(httpCodes.noContent).json({ message: 'No actor found', payload: { actor: {} } });
-  }
+  public static async getById(req: Request, res: Response) {}
 
   public static async getAll(req: Request, res: Response) {
killedBy: The Actors controller getById should call the actors service using the id
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/infrastructure/controller/Actors.ts:10:25
     const id = Number(req.params.id);
     const actor = await ActorsService.getById(id);
 
-    if (actor === null) {
-      res.status(httpCodes.internalServerError).json({ message: 'Our bad. Internal server error' });
-      return;
-    }
+    if (actor === null) {}
 
     const responseKeys = Object.keys(actor.actor);
killedBy: The Actors controller getById should return code 500 and error message if the service response is null
statusReason: TypeError: Cannot read properties of null (reading 'actor')

[Killed] ConditionalExpression
src/infrastructure/controller/Actors.ts:10:9
     const id = Number(req.params.id);
     const actor = await ActorsService.getById(id);
 
-    if (actor === null) {
+    if (true) {
       res.status(httpCodes.internalServerError).json({ message: 'Our bad. Internal server error' });
       return;
killedBy: The Actors controller getById should return code 204 and no actor if the service response is empty
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: 204
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/infrastructure/controller/Actors.ts:16:9
     }
 
     const responseKeys = Object.keys(actor.actor);
-    if (responseKeys.length === 3) {
+    if (false) {
       res.status(httpCodes.success).json({ payload: actor });
       return;
killedBy: The Actors controller getById should return code 200 and the actors if the service response is a success
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: 200
Received: 204

Number of calls: 1

[Killed] ConditionalExpression
src/infrastructure/controller/Actors.ts:16:9
     }
 
     const responseKeys = Object.keys(actor.actor);
-    if (responseKeys.length === 3) {
+    if (true) {
       res.status(httpCodes.success).json({ payload: actor });
       return;
killedBy: The Actors controller getById should return code 204 and no actor if the service response is empty
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: 204
Received: 200

Number of calls: 1

[Killed] ObjectLiteral
src/infrastructure/controller/Actors.ts:17:42
 
     const responseKeys = Object.keys(actor.actor);
     if (responseKeys.length === 3) {
-      res.status(httpCodes.success).json({ payload: actor });
+      res.status(httpCodes.success).json({});
       return;
     }
killedBy: The Actors controller getById should return code 200 and the actors if the service response is a success
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

- Object {
-   "payload": Object {
-     "actor": Object {

[Killed] ObjectLiteral
src/infrastructure/controller/Actors.ts:21:42
       return;
     }
 
-    res.status(httpCodes.noContent).json({ message: 'No actor found', payload: { actor: {} } });
+    res.status(httpCodes.noContent).json({});
   }
 
killedBy: The Actors controller getById should return code 204 and no actor if the service response is empty
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "No actor found",
-   "payload": Object {

[Killed] ObjectLiteral
src/infrastructure/controller/Actors.ts:21:80
       return;
     }
 
-    res.status(httpCodes.noContent).json({ message: 'No actor found', payload: { actor: {} } });
+    res.status(httpCodes.noContent).json({ message: 'No actor found', payload: {} });
   }
 
killedBy: The Actors controller getById should return code 204 and no actor if the service response is empty
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "No actor found",
-   "payload": Object {

[Killed] BlockStatement
src/infrastructure/controller/Actors.ts:24:59
     res.status(httpCodes.noContent).json({ message: 'No actor found', payload: { actor: {} } });
   }
 
-  public static async getAll(req: Request, res: Response) {
-    const actors = await ActorsService.getAll();
-
-    if (actors === null) {
-      res.status(httpCodes.internalServerError).json({ message: 'Our bad. Internal server error' });
-      return;
-    }
-
-    res.status(httpCodes.success).json({ payload: actors });
-  }
+  public static async getAll(req: Request, res: Response) {}
 }
 
killedBy: The Actors controller getAll should call the actors service
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/controller/Actors.ts:27:9
   public static async getAll(req: Request, res: Response) {
     const actors = await ActorsService.getAll();
 
-    if (actors === null) {
+    if (false) {
       res.status(httpCodes.internalServerError).json({ message: 'Our bad. Internal server error' });
       return;
killedBy: The Actors controller getAll should return code 500 and error message if the service response is null
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: 500
Received: 200

Number of calls: 1

[Killed] EqualityOperator
src/infrastructure/controller/Actors.ts:27:9
   public static async getAll(req: Request, res: Response) {
     const actors = await ActorsService.getAll();
 
-    if (actors === null) {
+    if (actors !== null) {
       res.status(httpCodes.internalServerError).json({ message: 'Our bad. Internal server error' });
       return;
killedBy: The Actors controller getAll should return code 500 and error message if the service response is null
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: 500
Received: 200

Number of calls: 1

[Killed] ObjectLiteral
src/infrastructure/controller/Actors.ts:32:40
       return;
     }
 
-    res.status(httpCodes.success).json({ payload: actors });
+    res.status(httpCodes.success).json({});
   }
 }
killedBy: The Actors controller getAll should return code 200 and the actors if the service response is a success
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

- Object {
-   "payload": Array [
-     Object {
