[Killed] BlockStatement
src/infrastructure/error/ClientError.ts:13:104
 
   private readonly details: ValidationErrorItem[];
 
-  constructor(status: ValueOf<typeof httpCodes>, message: string, details: ValidationErrorItem[] = []) {
-    this.status = status;
-    this.message = message;
-    this.details = details;
-  }
+  constructor(status: ValueOf<typeof httpCodes>, message: string, details: ValidationErrorItem[] = []) {}
 
   public getStatus() {
killedBy: The ErrorHandler should call the status the client presentation if an error is raised
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/infrastructure/error/ClientError.ts:19:22
     this.details = details;
   }
 
-  public getStatus() {
-    return this.status;
-  }
+  public getStatus() {}
 
   private getMessage() {
killedBy: The ClientError should return the status when calling getStatus
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 200
Received: undefined

[Killed] BlockStatement
src/infrastructure/error/ClientError.ts:23:24
     return this.status;
   }
 
-  private getMessage() {
-    return this.message;
-  }
+  private getMessage() {}
 
   private getDetails() {
killedBy: The ClientError should return a detailed message error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "details": Array [
      "\"value\" must be a string",

[Killed] BlockStatement
src/infrastructure/error/ClientError.ts:27:24
     return this.message;
   }
 
-  private getDetails() {
-    return this.details;
-  }
+  private getDetails() {}
 
   public presentToClient() {
killedBy: The ErrorHandler should call the status the client presentation if an error is raised
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/infrastructure/error/ClientError.ts:31:28
     return this.details;
   }
 
-  public presentToClient() {
-    return {
-      message: this.getMessage(),
-      details: [
-        ...this.getDetails().map(({ message }) => message),
-      ],
-    };
-  }
+  public presentToClient() {}
 }
 
killedBy: The ClientError should return a detailed message error
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"details": ["\"value\" must be a string", "\"value\" must be a number"], "message": "\"value\" must be a string"}
Received: undefined

[Killed] ObjectLiteral
src/infrastructure/error/ClientError.ts:32:12
   }
 
   public presentToClient() {
-    return {
-      message: this.getMessage(),
-      details: [
-        ...this.getDetails().map(({ message }) => message),
-      ],
-    };
+    return {};
   }
 }
killedBy: The ClientError should return a detailed message error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "details": Array [
-     "\"value\" must be a string",

[Killed] ArrayDeclaration
src/infrastructure/error/ClientError.ts:34:16
   public presentToClient() {
     return {
       message: this.getMessage(),
-      details: [
-        ...this.getDetails().map(({ message }) => message),
-      ],
+      details: [],
     };
   }
killedBy: The ClientError should return a detailed message error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Object {
-   "details": Array [
-     "\"value\" must be a string",

[Killed] ArrowFunction
src/infrastructure/error/ClientError.ts:35:34
     return {
       message: this.getMessage(),
       details: [
-        ...this.getDetails().map(({ message }) => message),
+        ...this.getDetails().map(() => undefined),
       ],
     };
killedBy: The ClientError should return a detailed message error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "details": Array [
-     "\"value\" must be a string",
