[Killed] BlockStatement
src/infrastructure/middlewares/Actors.ts:7:79
 import { ClientError } from '../error';
 
 export class Actors {
-  public static checkActorId(req: Request, res: Response, next: NextFunction) {
-    const schema = Joi.string().pattern(/^\d+$/).required();
-    const result = schema.validate(req.params.id);
-
-    if (!result.error) {
-      next();
-    } else {
-      const error = new ClientError(httpCodes.badRequest, result.error.message, result.error.details);
-      next(error);
-    }
-  }
+  public static checkActorId(req: Request, res: Response, next: NextFunction) {}
 }
 
killedBy: The Actors middleware should call next when the req param matches the pattern
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] Regex
src/infrastructure/middlewares/Actors.ts:8:41
 
 export class Actors {
   public static checkActorId(req: Request, res: Response, next: NextFunction) {
-    const schema = Joi.string().pattern(/^\d+$/).required();
+    const schema = Joi.string().pattern(/^\d+/).required();
     const result = schema.validate(req.params.id);
 
killedBy: The Actors middleware should call next with error param when the req param doesn't matches the pattern
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

@@ -2,16 +2,16 @@
    "details": Array [
      Object {

[Killed] ConditionalExpression
src/infrastructure/middlewares/Actors.ts:11:9
     const schema = Joi.string().pattern(/^\d+$/).required();
     const result = schema.validate(req.params.id);
 
-    if (!result.error) {
+    if (true) {
       next();
     } else {
killedBy: The Actors middleware should call next with error param when the req param doesn't matches the pattern
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Received: called with 0 arguments

Number of calls: 1

[Killed] BooleanLiteral
src/infrastructure/middlewares/Actors.ts:11:9
     const schema = Joi.string().pattern(/^\d+$/).required();
     const result = schema.validate(req.params.id);
 
-    if (!result.error) {
+    if (result.error) {
       next();
     } else {
killedBy: The Actors middleware should call next when the req param matches the pattern
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] BlockStatement
src/infrastructure/middlewares/Actors.ts:13:12
 
     if (!result.error) {
       next();
-    } else {
-      const error = new ClientError(httpCodes.badRequest, result.error.message, result.error.details);
-      next(error);
-    }
+    } else {}
   }
 }
killedBy: The Actors middleware should call next with error param when the req param doesn't matches the pattern
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
