[Killed] BlockStatement
src/infrastructure/error/ErrorHandler.ts:7:43
 import { ClientError } from './ClientError';
 
 export class ErrorHandler {
-  public static express(app: Application) {
-    app.use(ErrorHandler.expressHandler);
-  }
+  public static express(app: Application) {}
 
   public static expressHandler(err: ClientError, req: Request, res: Response, next: NextFunction) {
killedBy: The ErrorHandler should use the express method for general error handling
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: [Function expressHandler]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/error/ErrorHandler.ts:11:99
     app.use(ErrorHandler.expressHandler);
   }
 
-  public static expressHandler(err: ClientError, req: Request, res: Response, next: NextFunction) {
-    res.status(err.getStatus()).json(err.presentToClient());
-    next(err);
-  }
+  public static expressHandler(err: ClientError, req: Request, res: Response, next: NextFunction) {}
 }
 
killedBy: The ErrorHandler should call the status the client presentation if an error is raised
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: 500

Number of calls: 0
