[Killed] BlockStatement
src/infrastructure/routes.ts:6:45
 import { Actors as actorsMiddleware } from './middlewares';
 
 export class Routes {
-  public static loadRoutes(router: Express) {
-    router.get('/actors', Actors.getAll);
-    router.get('/actors/:id', actorsMiddleware.checkActorId, Actors.getById);
-  }
+  public static loadRoutes(router: Express) {}
 }
 
killedBy: The router should load two routes
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0
