[Killed] BlockStatement
src/infrastructure/controller/Actors.ts:6:60
 import { httpCodes } from '../httpCodes';
 
 export class Actors {
-  public static async getById(req: Request, res: Response) {
-    const id = Number(req.params.id);
-    const actor = await ActorsService.getById(id);
-
-    if (actor === null) {
-      res.status(httpCodes.internalServerError).json({ message: 'Our bad. Internal server error' });
-      return;
-    }
-
-    if (actor.length === 0) {
-      res.status(httpCodes.noContent).json({ message: 'No actor found', payload: { actor: {} } });
-      return;
-    }
-
-    res.status(httpCodes.success).json({ payload: { actor: actor[0] } });
-  }
+  public static async getById(req: Request, res: Response) {}
 
   public static async getAll(req: Request, res: Response) {
killedBy: The Actors controller getById should call the actors service using the id
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/controller/Actors.ts:15:9
       return;
     }
 
-    if (actor.length === 0) {
+    if (true) {
       res.status(httpCodes.noContent).json({ message: 'No actor found', payload: { actor: {} } });
       return;
killedBy: The Actors controller getById should return code 200 and the actors if the service response is a success
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: 200
Received: 204

Number of calls: 1

[Killed] ConditionalExpression
src/infrastructure/controller/Actors.ts:15:9
       return;
     }
 
-    if (actor.length === 0) {
+    if (false) {
       res.status(httpCodes.noContent).json({ message: 'No actor found', payload: { actor: {} } });
       return;
killedBy: The Actors controller getById should return code 204 and the no actor if the service response is empty
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: 204
Received: 200

Number of calls: 1

[Killed] ObjectLiteral
src/infrastructure/controller/Actors.ts:20:40
       return;
     }
 
-    res.status(httpCodes.success).json({ payload: { actor: actor[0] } });
+    res.status(httpCodes.success).json({});
   }
 
killedBy: The Actors controller getById should return code 200 and the actors if the service response is a success
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

- Object {
-   "payload": Object {
-     "actor": Object {

[Killed] BlockStatement
src/infrastructure/controller/Actors.ts:26:26
   public static async getAll(req: Request, res: Response) {
     const actors = await ActorsService.getAll();
 
-    if (actors === null) {
-      res.status(httpCodes.internalServerError).json({ message: 'Our bad. Internal server error' });
-      return;
-    }
+    if (actors === null) {}
 
     res.status(httpCodes.success).json({ payload: actors });
killedBy: The Actors controller getAll should return code 500 and error message if the service response is null
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: 500
Received: 200

Number of calls: 1

[Killed] StringLiteral
src/infrastructure/controller/Actors.ts:27:65
     const actors = await ActorsService.getAll();
 
     if (actors === null) {
-      res.status(httpCodes.internalServerError).json({ message: 'Our bad. Internal server error' });
+      res.status(httpCodes.internalServerError).json({ message: "" });
       return;
     }
killedBy: The Actors controller getAll should return code 500 and error message if the service response is null
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Our bad. Internal server error",
+   "message": "",
