[Killed] BlockStatement
src/domain/service/Actors.ts:8:43
     return ActorsModel.getAll();
   }
 
-  public static async getById(id: number) {
-    const response = await ActorsModel.getById(id);
-
-    if (response !== null) {
-      return response;
-    }
-
-    return null;
-  }
+  public static async getById(id: number) {}
 }
 
killedBy: The Actors controller getById should call the actors service using the id
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/domain/service/Actors.ts:11:9
   public static async getById(id: number) {
     const response = await ActorsModel.getById(id);
 
-    if (response !== null) {
+    if (false) {
       return response;
     }
killedBy: The Actors controller Get actor by id should return an empty list if no actors are found
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: null

[Killed] BlockStatement
src/domain/service/Actors.ts:11:28
   public static async getById(id: number) {
     const response = await ActorsModel.getById(id);
 
-    if (response !== null) {
-      return response;
-    }
+    if (response !== null) {}
 
     return null;
killedBy: The Actors controller Get actor by id should return an empty list if no actors are found
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: null
