[Killed] BlockStatement
src/model/Actors.ts:4:32
 import { connection } from './connection';
 
 export class Actors {
-  public static async getAll() {
-    const client = await connection.connect();
-    try {
-      const actors = await client.query(
-        `SELECT actor_id as id,
-                        first_name,
-                        last_name
-                 FROM Actor;
-                `,
-      );
-
-      return actors.rows;
-    } catch (e) {
-      return null;
-    } finally {
-      await client.release();
-    }
-  }
+  public static async getAll() {}
 
   public static async getById(id: number) {
killedBy: The actor model getAll should execute connection exactly one time
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/model/Actors.ts:6:9
 export class Actors {
   public static async getAll() {
     const client = await connection.connect();
-    try {
-      const actors = await client.query(
-        `SELECT actor_id as id,
-                        first_name,
-                        last_name
-                 FROM Actor;
-                `,
-      );
-
-      return actors.rows;
-    } catch (e) {
+    try {} catch (e) {
       return null;
     } finally {
killedBy: The actor model getAll should query only after the connection is established
statusReason: Error: expect(received).toBeLessThan(expected)

Matcher error: expected value must be a number or bigint

Expected has value: undefined

[Killed] BlockStatement
src/model/Actors.ts:23:43
     }
   }
 
-  public static async getById(id: number) {
-    const client = await connection.connect();
-    try {
-      const actor = await client.query(
-        `SELECT actor_id as id,
-                        first_name,
-                        last_name
-                 FROM Actor
-                 WHERE actor_id = $1
-                 LIMIT 1`,
-        [id],
-      );
-
-      return actor.rows;
-    } catch (e) {
-      return null;
-    } finally {
-      await client.release();
-    }
-  }
+  public static async getById(id: number) {}
 }
 
killedBy: The Actors controller getById should call the actors service using the id
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/model/Actors.ts:25:9
 
   public static async getById(id: number) {
     const client = await connection.connect();
-    try {
-      const actor = await client.query(
-        `SELECT actor_id as id,
-                        first_name,
-                        last_name
-                 FROM Actor
-                 WHERE actor_id = $1
-                 LIMIT 1`,
-        [id],
-      );
-
-      return actor.rows;
-    } catch (e) {
+    try {} catch (e) {
       return null;
     } finally {
killedBy: The Actors controller getById should call the actors service using the id
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Survived] StringLiteral
src/model/Actors.ts:27:9
     const client = await connection.connect();
     try {
       const actor = await client.query(
-        `SELECT actor_id as id,
-                        first_name,
-                        last_name
-                 FROM Actor
-                 WHERE actor_id = $1
-                 LIMIT 1`,
+        ``,
         [id],
       );
